export default function mainFooter() {
    return (
        // footer
        <footer className="site-footer">
            <div>
                {/* top */}
                <div class="footer-top">
                    <p>1. Apple Intelligence는 Siri 및 기기 언어를 한국어, 중국어(간체), 영어(오스트레일리아, 캐나다, 인도, 아일랜드, 뉴질랜드, 싱가포르, 남아프리카 공화국, 영국, 미국), 프랑스어, 독일어, 이탈리아어, 일본어, 포르투갈어(브라질), 스페인어로 설정한 iPhone 16 전체 모델, iPhone 15 Pro, iPhone 15 Pro Max, iPad mini(A17 Pro 모델) 그리고 M1 이후 iPad 및 Mac 모델에서 베타로 사용할 수 있으며, iOS 18, iPadOS 18, macOS Sequoia 소프트웨어 업데이트를 통해 제공됩니다. 올해 안으로 계속해서 베트남어를 비롯한 지원 언어를 추가해 나갈 예정입니다. 일부 기능은 한국어로 제공되지 않습니다.</p>
                    <p>2. 두 가지 모델로 제공: AirPods 4 및 AirPods 4 액티브 노이즈 캔슬링 모델.</p>
                    <p>3. ₩1,030,000은 iPhone 15 Pro Max 1TB 모델의 보상 판매 금액으로, 보상 판매 서비스는 Apple의 보상 판매 파트너사를 통해 제공됩니다. Apple 및 Apple의 계열사는 고객과 파트너 간 계약의 당사자가 아닙니다. 보상 판매 견적액은 예상 금액일 뿐이며, 실제 보상 판매 금액이 예상 금액보다 낮을 수도 있습니다. 보상 판매 금액은 보상 판매 대상이 되는 제품의 상태, 연도, 모델, 그리고 보상 판매 대상이 되는 제품이 최초 판매된 국가/지역에 따라 달라집니다. 일부 기기는 보상 판매 대상이 아닙니다. 기기를 보상 판매하기 위해서는 민법상 성년이어야 합니다. 보상 판매 금액은 적용 가능한 새 기기 구입 시 적용하거나 Apple Store Gift Card로 받을 수 있습니다. 새 Apple 기기 구매 시, 현재 소유한 기기의 가치만큼 할인을 받을 수도 있습니다. 최종 확정 금액은 보상 판매 대상 기기를 수령한 후, 예상 금액 산정 시 제시한 기기의 설명과 일치하는지 비교 검수 후 정해집니다. 부가세는 새로 구입한 기기의 총액을 바탕으로 부과됩니다. 일부 매장에서는 보상 판매를 제공하지 않으며, 매장 내 보상 판매와 온라인 보상 판매 프로그램 간 내용에 차이가 있을 수 있습니다. 일부 매장은 추가 요구 사항이 있을 수 있습니다. Apple의 보상 판매 파트너는 보상 판매 거래를 거부, 취소하거나 보상 판매 수량을 제한할 권리를 보유합니다. 적용 대상 기기의 보상 판매 및 재활용에 대한 자세한 내용은 Apple의 보상 판매 파트너사에서 확인할 수 있습니다. 규제 및 제한이 적용될 수 있습니다.</p>
                    <p>Apple TV+ 이용을 위해서는 구독이 필요합니다.</p>
                    <p>기능은 변경될 수 있습니다. 일부 기능, 애플리케이션 및 서비스를 이용할 수 없는 국가나 언어도 있습니다.</p>
                    <p>사용 가능한 티머니 카드를 Apple 지갑에 추가하기 위해서는 iOS 17.2 이후 버전이 설치된 iPhone XS, XR 이후 모델, 또는 watchOS 10.2 이후 버전이 설치된 Apple Watch Series 6, SE 2세대 이후 모델이 필요합니다. Apple 지갑에는 선불형 티머니 카드만 추가할 수 있습니다.</p>
                    <p>Apple 지갑 속 티머니는 일부 시외버스 또는 일부 지역의 택시를 제외한, 티머니를 사용할 수 있는 대한민국의 교통수단 어디에서든 사용 가능합니다. 티머니 사용처에 대한 자세한 설명은 여기를 참고하십시오. 대한민국에서는 선불형 티머니 카드만 Apple 지갑 속 교통카드로 사용이 지원됩니다.</p>
                    <hr />
                </div>

                {/* middle */}
                <div className="footer-middle"></div>

                {/* bottom */}
                <div className="footer-bottom">
                    <p class="copyright">Copyright © 2025 Apple Inc. 모든 권리 보유.</p>
                    <p class="legal">개인정보 처리방침 | 웹 사이트 이용 약관 | 판매 및 환불 | 법적 고지 | 사이트 맵</p>
                    <p class="requirement">애플코리아 유한회사 | 대표이사: Mark Lee(마크리) | 주소: 서울특별시 강남구 영동대로 517 | 전화: 080-333-4000 | https://support.apple.com/ko-kr | 사업자등록번호: 120-81-84429 | 통신판매업신고번호: 제2011-서울강남-00810호 | 호스팅 서비스 제공: Apple Inc. | 사업자정보</p>
                    <div></div>

                </div>
            </div>

        </footer>
    );
}